# count() 计算某个元素在元组中出现的次数
# index() 获取值在元组中的索引

# clear() 清楚整个字典 返回None
# copy() 赋值字典
# fromkeys() 安装指定的序列为键创建字典，值是一样的
# get() 根据键获取指定的值 找不到的键如果没默认值则返回默认值，如果没设默认值，则返回None
# items() 将字典编程类似于元组的形式方便遍历
# pop() 移除字典中指定元素  返回键所对应的值，若果键不存在，则返回默认值，如果键找不到，没设默认值，就会报错
# popitem() 移除字典的键值对 返回移除的键和值
# setdefault() 在字典中添加一个元素
# update() 修改字典中的值

# add() 向集合中添加元素
# pop() 随机弹出一个元素
# remove() 删除集合中的某个值，如果这个值不在集合中会报错
# discard() 删除集合中的某个值，如果这个值不在集合中什么也不做
# difference() 差集
# difference_update() 区别就是第一个返回一个新的集合，第二个是把原来集合覆盖

